mafaneh/ble-ebook-project/nRF5_SDK_current/examples/ble_central/experimental/ble_app_ots_c/main.c
        case BSP_EVENT_SLEEP:
            sleep_mode_enter();
            break;

        case BSP_EVENT_DISCONNECT:
        {
            ret_code_t err_code;
            err_code = sd_ble_gap_disconnect(m_conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
        }break;

        case BSP_EVENT_WHITELIST_OFF:
            whitelist_disable();
            break;

        default:
            break;
    }
}


static void print_feature(nrf_ble_ots_c_feature_t const * const p_feature)
{
    if (p_feature->oacp_create == 1)
    {
        NRF_LOG_INFO("\tCreate OP Code Supported");
    }
    if (p_feature->oacp_delete == 1)
    {
        NRF_LOG_INFO("\tDelete OP Code Supported");
    }
    if (p_feature->oacp_crc == 1)
    {
        NRF_LOG_INFO("\tCalculate Checksum OP Code Supported.");
    }
    if (p_feature->oacp_execute == 1)
    {
        NRF_LOG_INFO("\tExecute OP Code Supported.");
    }
    if (p_feature->oacp_read == 1)
    {
        NRF_LOG_INFO("\tRead OP Code Supported.");
    }
    if (p_feature->oacp_write == 1)
    {
        NRF_LOG_INFO("\tWrite OP Code Supported.");
    }
    if (p_feature->oacp_append == 1)
    {
        NRF_LOG_INFO("\tAppend Additional Data to Objects Supported.");
    }
    if (p_feature->oacp_truncate == 1)
    {
        NRF_LOG_INFO("\tTruncation of Objects Supported.");
    }
    if (p_feature->oacp_patch == 1)
    {
        NRF_LOG_INFO("\tPatching of Objects Supported.");
    }
    if (p_feature->oacp_abort == 1)
    {
        NRF_LOG_INFO("\tAbort OP Code Supported.");
    }

    // PRINT OLCP FEATURES
    if (p_feature->olcp_goto == 1)
    {
        NRF_LOG_INFO("\tGoto OP Code Supported.");
    }
    if (p_feature->olcp_order == 1)
    {
        NRF_LOG_INFO("\tOrder OP Code Supported.");
    }
    if (p_feature->olcp_req_num == 1)
    {
        NRF_LOG_INFO("\tRequest Number OP Code Supported.");
    }
    if (p_feature->olcp_req_num == 1)
    {
        NRF_LOG_INFO("\tClear Marking OP Code Supported.");
    }
    NRF_LOG_INFO("\r\n");
}

static void print_response(nrf_ble_ots_c_oacp_response_t * response)
{
    NRF_LOG_INFO("Request OP Code: %s", (uint32_t)lit_request[response->request_op_code]);
    NRF_LOG_INFO("Result Code    : %s", (uint32_t)lit_result[response->result_code]);
}


static bool peer_ready_for_object_write(nrf_ble_ots_c_evt_t const * const p_ots_c_evt)
{
    if (p_ots_c_evt->params.response.request_op_code == NRF_BLE_OTS_C_OACP_PROC_WRITE
       && p_ots_c_evt->params.response.result_code == NRF_BLE_OTS_C_OACP_RES_SUCCESS)
    {
        return true;
    }
    return false;
}

static bool peer_ready_for_object_read(nrf_ble_ots_c_evt_t const * const p_ots_c_evt)
{
    if (p_ots_c_evt->params.response.request_op_code == NRF_BLE_OTS_C_OACP_PROC_READ
       && p_ots_c_evt->params.response.result_code == NRF_BLE_OTS_C_OACP_RES_SUCCESS)
    {
        return true;
    }
    return false;
}

/**@brief Object Transfer Service event handler.
 */
static void ots_c_evt_handler(nrf_ble_ots_c_evt_t * p_ots_c_evt)
{
    ret_code_t err_code;

    switch (p_ots_c_evt->evt_type)
    {
        case NRF_BLE_OTS_C_EVT_DISCOVERY_COMPLETE:
        {
            err_code = nrf_ble_ots_c_handles_assign(&m_ots_c,
                                                    p_ots_c_evt->conn_handle,
                                                    &p_ots_c_evt->params.handles);
            APP_ERROR_CHECK(err_code);

            NRF_LOG_INFO("Object Transfer Service discovered.");

            NRF_LOG_DEBUG("L2CAP channel setup.");
            ble_l2cap_ch_setup_params_t params;

            params.rx_params.rx_mps = L2CAP_RX_MPS;
            params.rx_params.rx_mtu = L2CAP_RX_MTU;
            params.rx_params.sdu_buf.p_data = NULL;
            params.le_psm = BLE_OTS_PSM;    // Used when requesting setup of an L2CAP channel, ignored otherwise.
            params.status = 0;              // Used when requesting setup of an L2CAP channel, ignored otherwise.

            uint16_t cid  = BLE_L2CAP_CID_INVALID;

            err_code = sd_ble_l2cap_ch_setup(m_ots_c.conn_handle, &cid, &params);
            APP_ERROR_CHECK(err_code);

            m_ots_c.local_cid = cid;        // Set the local Channel ID of the Object Transfer Client Module.
            NRF_LOG_DEBUG("Read the features of the peer:");
            err_code = nrf_ble_ots_c_feature_read(&m_ots_c);
            APP_ERROR_CHECK(err_code);
        } break;

        case NRF_BLE_OTS_C_EVT_FEATURE_READ_RESP:
            NRF_LOG_INFO("\r\n");
            NRF_LOG_INFO("Supported features on the connected Server:");
            print_feature(&p_ots_c_evt->params.feature);

            err_code = nrf_ble_ots_c_indication_enable(&m_ots_c, true);
            APP_ERROR_CHECK(err_code);
            NRF_LOG_INFO("Indications enabled.");

            break;

        case NRF_BLE_OTS_C_EVT_SIZE_READ_RESP:
            NRF_LOG_INFO("Selected object: current size %i, allocated size %i",
                          p_ots_c_evt->params.size.current_size,
                          p_ots_c_evt->params.size.allocated_size);
            if (p_ots_c_evt->params.size.current_size > 0)
            {
                if (p_ots_c_evt->params.size.current_size > OBJECT_SIZE)
                {
                    p_ots_c_evt->params.size.current_size = OBJECT_SIZE;
                }
                NRF_LOG_INFO("Read %i bytes from the object.",
                              p_ots_c_evt->params.size.current_size);
                err_code = nrf_ble_ots_c_oacp_read_object(&m_ots_c,
                                                          0,
                                                          p_ots_c_evt->params.size.current_size);
                APP_ERROR_CHECK(err_code);
            }
            break;

        case NRF_BLE_OTS_C_EVT_OACP_RESP:
            NRF_LOG_INFO("Response received on Object Action Control Point.");
            print_response(&p_ots_c_evt->params.response);

            if (peer_ready_for_object_write(p_ots_c_evt))
            {
                m_sdu_buf.p_data = m_object;
                m_sdu_buf.len    = OBJECT_SIZE;
                err_code         = nrf_ble_ots_c_l2cap_obj_send(&m_ots_c, &m_sdu_buf);
                APP_ERROR_CHECK(err_code);
            }
            if (peer_ready_for_object_read(p_ots_c_evt))
            {
                m_sdu_buf.p_data = m_object_rx;
                m_sdu_buf.len    = OBJECT_SIZE;
                err_code = nrf_ble_ots_c_l2cap_obj_receive(&m_ots_c, &m_sdu_buf);
                APP_ERROR_CHECK(err_code);
            }
            break;

